rafaelcapurroc-droid/esp32-motor-control/src/main.cpp
// ============================================================
// 7. ENCODER KY-040
// ============================================================
ESP32Encoder encoder;
int           lastStableCount    = 0;
unsigned long lastStableTime     = 0;
const unsigned long ENCODER_STABILITY_DELAY_MS = 5;
int           displayEncoderCount = 0;

volatile bool encoderButtonPressed  = false;
unsigned long lastButtonDebounce    = 0;
const unsigned long ENCODER_BUTTON_DEBOUNCE_MS = 50;

// ============================================================
// 8. PARADA DE EMERGENCIA
// ============================================================
volatile bool emergencyStopTriggered = false;
bool          emergencyStopPending   = false;
unsigned long lastEmergencyDebounce  = 0;
const unsigned long EMERGENCY_DEBOUNCE_MS = 100;

// ============================================================
// 9. CORRIENTE
// ============================================================
float         cachedCurrent       = 0.0f;
unsigned long lastCurrentReadTime = 0;

// ============================================================
// 10. LCD
// ============================================================
LiquidCrystal_I2C* lcd        = nullptr;
unsigned long      lastLcdUpdate = 0;

// ============================================================
// 11. SERIAL
// ============================================================
static char    serialBuf[64];
static uint8_t serialIdx = 0;
unsigned long  lastDebugTime = 0;

// ============================================================
// 12. LED
// ============================================================
#define LED_BUILTIN_PIN 2
unsigned long lastBlink = 0;

// ============================================================
// 13. DECLARACIONES ANTICIPADAS
// ============================================================
void broadcastState();
void motorStop();
void computePID();

// ============================================================
// 14. IMPLEMENTACIÓN DE FUNCIONES
// ============================================================

void applyPWM(int pwmVal) {
  pwmVal = constrain(pwmVal, 0, MAX_VELOCITY);
#if ESP_IDF_VERSION_MAJOR >= 5
  ledcWrite(MOTOR_PWM_PIN, (uint32_t)pwmVal);
#else
  ledcWrite(PWM_CHANNEL, (uint32_t)pwmVal);
#endif
}

void configurarMotorReversa() {
  digitalWrite(MOTOR_IN1_PIN, LOW);
  digitalWrite(MOTOR_IN2_PIN, HIGH);
}

void motorParadaLibre() {
  digitalWrite(MOTOR_IN1_PIN, LOW);
  digitalWrite(MOTOR_IN2_PIN, LOW);
}

// ---------------------
// motorStop: apaga motor, reset PID manual
// ---------------------
void motorStop() {
  setpointSpeed   = 0.0f;
  pendingSetpoint = 0.0f;
  setpointPending = false;
  pidOutput       = 0.0f;
  applyPWM(0);
  motorParadaLibre();

  // Resetear PID (MANUAL + Output=0 → próximo SetMode(AUTOMATIC) arranca desde 0)
  myPID.SetMode(MANUAL);
  pidOut      = 0.0;
  pidIntegral = 0.0f;
  Serial.println("[PID] Motor detenido — PID reset");
}

// ---------------------
// calcularFeedForward: calcula PWM de FF para un setpoint dado
// (CONSERVADA — no activa; tabla medida empíricamente en lazo abierto)
// ---------------------
// static float calcularFeedForward(float sp) {
//   // Tabla medida empíricamente (lazo abierto)
//   // { velocidad m/s, PWM }
//   static const float VEL[] = {0.41f, 0.52f, 0.64f, 0.73f, 0.86f, 0.98f,
//                                1.10f, 1.21f, 1.33f, 1.44f, 1.56f, 1.67f,
//                                1.78f, 1.90f};
//   static const float PWM[] = {200,   300,   350,   400,   450,   500,
//                                550,   600,   650,   700,   750,   800,
//                                850,   900};
//   static const uint8_t N = 14;
//
//   if (sp <= VEL[0])   return PWM[0];
//   if (sp >= VEL[N-1]) return PWM[N-1];
//
//   for (uint8_t i = 0; i < N - 1; i++) {
//     if (sp >= VEL[i] && sp <= VEL[i+1]) {
//       float t = (sp - VEL[i]) / (VEL[i+1] - VEL[i]);
//       return PWM[i] + t * (PWM[i+1] - PWM[i]);
//     }
//   }
//   return PWM[N-1];
// }

// ---------------------
// activarPID: configura setpoint y arranca el PID
// ---------------------
static void activarPID(float sp) {
  // --- Feed-Forward (conservado, no activo) ---
  // lastFF_PWM = calcularFeedForward(sp);
  // pidOut = lastFF_PWM;  // bumpless transfer: carga el integral de Brett con el FF
  // applyPWM((int)round(lastFF_PWM));
  // -------------------------------------------

  pidSp = sp;
  pidIn = currentLinearSpeedMs;
  myPID.SetMode(AUTOMATIC);
  lastControlMicros = micros();

  Serial.printf("[PID] Activado — SP: %.3f m/s\n", sp);
}

// ---------------------
// computePID: delega en PID de Brett Beauregard (maneja timing internamente)
// ---------------------
void computePID() {
  if (setpointSpeed == 0.0f) {
    pidOutput = 0.0f;
    return;
  }

  pidIn = currentLinearSpeedMs;
  pidSp = setpointSpeed;

  if (myPID.Compute()) {
    pidOutput = (float)pidOut;
    applyPWM((int)round(pidOutput));
    lastControlMicros = micros();  // actualiza el fallback timer
  }
}

// ---------------------
// confirmarSetpoint: aplica setpoint pendiente del encoder
// ---------------------
void confirmarSetpoint() {
  if (!setpointPending) return;

  setpointSpeed = constrain(pendingSetpoint, 0.0f, 2.0f);
  setpointPending = false;

  if (setpointSpeed == 0.0f) {
    motorStop();
    Serial.println("[ENCODER] Setpoint confirmado: 0 — Motor detenido");
  } else {
    configurarMotorReversa();
    activarPID(setpointSpeed);
    Serial.printf("[ENCODER] Setpoint confirmado: %.3f m/s\n", setpointSpeed);
  }

  broadcastState();
}

// ---------------------
// procesarEntradasEncoder
// ---------------------
void procesarEntradasEncoder() {
  int rawCount      = encoder.getCount();
  unsigned long ahora = millis();

  if (rawCount != lastStableCount) {
    lastStableTime  = ahora;
    lastStableCount = rawCount;
  }

  if ((ahora - lastStableTime) >= ENCODER_STABILITY_DELAY_MS) {
    int newDisplayCount = rawCount / 2;

    if (newDisplayCount != displayEncoderCount) {
      int delta = newDisplayCount - displayEncoderCount;
      displayEncoderCount = newDisplayCount;

      pendingSetpoint += delta * 0.05f;
      pendingSetpoint  = constrain(pendingSetpoint, 0.0f, 2.0f);
      setpointPending  = true;

      Serial.printf("[ENCODER] Setpoint temporal: %.3f m/s (delta: %d)\n",
                    pendingSetpoint, delta);
      broadcastState();
    }
  }

