rafaelcapurroc-droid/esp32-motor-control/src/main.cpp
  // Botón: confirmar setpoint pendiente
  if (encoderButtonPressed) {
    unsigned long ahoraMs = millis();
    if (ahoraMs - lastButtonDebounce > ENCODER_BUTTON_DEBOUNCE_MS) {
      confirmarSetpoint();
      lastButtonDebounce = ahoraMs;
    }
    encoderButtonPressed = false;
  }
}

// ============================================================
// 15. ISRs
// ============================================================
void IRAM_ATTR ISR_SensorHall() {
  uint32_t ahora = micros();

  if (lastHallMicros == 0) {
    lastHallMicros = ahora;
    return;
  }

  uint32_t periodo = ahora - lastHallMicros;

  if (periodo >= hallMinPeriodUs) {
    lastHallMicros = ahora;
    hallPeriodBuffer[hallBufferHead] = periodo;
    hallBufferHead = (hallBufferHead + 1) % HALL_BUFFER_SIZE;
    if (hallBufferCount < HALL_BUFFER_SIZE) hallBufferCount++;
  }
  // Pulso espurio: NO se avanza lastHallMicros, así el próximo flanco real
  // mide el período completo desde el último pulso válido (evita que el
  // rebote parta el período en dos fragmentos cortos).
}

void IRAM_ATTR ISR_EncoderBoton() {
  if (millis() - lastButtonDebounce > ENCODER_BUTTON_DEBOUNCE_MS) {
    encoderButtonPressed = true;
  }
}

void IRAM_ATTR ISR_EmergencyStop() {
  emergencyStopTriggered = true;
}

// ============================================================
// 16. CÁLCULO DE VELOCIDAD + PID EVENT-DRIVEN
// ============================================================
static float getMedian(uint32_t* arr, uint8_t size, uint8_t count) {
  uint32_t temp[FILTER_SIZE];
  uint8_t  n = (count < size) ? count : size;
  if (n == 0) return 0.0f;
  memcpy(temp, arr, n * sizeof(uint32_t));
  std::sort(temp, temp + n);
  return (float)temp[n / 2];
}

// Empuja una muestra cruda (sin filtrar) al log imán por imán.
static void logPulsoCrudo(uint32_t periodo_us, float rpm, float vel_m_s) {
  if (pulseLogCount >= PULSE_LOG_SIZE) {
    pulseLogOverflow = true;
    return;
  }
  pulseLogBuffer[pulseLogCount].periodo_us = periodo_us;
  pulseLogBuffer[pulseLogCount].rpm        = rpm;
  pulseLogBuffer[pulseLogCount].vel_m_s    = vel_m_s;
  pulseLogCount++;
}

static void calculateSpeed() {
  uint32_t periods[HALL_BUFFER_SIZE];
  uint8_t  currentHead;
  uint32_t ultimoPulso;

  portDISABLE_INTERRUPTS();
  memcpy(periods, (const void*)hallPeriodBuffer, sizeof(periods));
  currentHead  = hallBufferHead;
  ultimoPulso  = lastHallMicros;
  portENABLE_INTERRUPTS();

  bool timeout = (ultimoPulso == 0) || ((micros() - ultimoPulso) > HALL_TIMEOUT_US);

  if (timeout) {
    currentRPM           = 0.0f;
    currentLinearSpeedMs = 0.0f;
    filteredRPM_Last     = 0.0f;
    filteredVel_Last     = 0.0f;

    memset(filterBuffer, 0, sizeof(filterBuffer));
    filterCount = 0;
    filterIndex = 0;

    memset(revPeriodBuffer, 0, sizeof(revPeriodBuffer));
    revBufIndex    = 0;
    revBufCount    = 0;
    revPeriodSum   = 0;
    displaySpeedMs = 0.0f;

    portDISABLE_INTERRUPTS();
    hallBufferCount   = 0;
    hallBufferHead    = 0;
    lastProcessedHead = 0;
    lastHallMicros    = 0;  // reset: el próximo imán será la referencia, el siguiente se mide
    hallMinPeriodUs   = HALL_DEBOUNCE_US;  // vuelve al piso hasta tener mediana nueva
    memset((void*)hallPeriodBuffer, 0, sizeof(hallPeriodBuffer));
    portENABLE_INTERRUPTS();

    // Tras timeout: Brett PID retoma en el próximo Compute() con Input~0
    return;
  }

  uint8_t prevProcessedHead = lastProcessedHead;
  uint8_t newPulses = (currentHead - prevProcessedHead + HALL_BUFFER_SIZE) % HALL_BUFFER_SIZE;
  lastProcessedHead = currentHead;

  if (newPulses == 0) return;

  // Acumular períodos crudos válidos en array local para CSV post-EMA
  uint32_t rawPeriods[HALL_BUFFER_SIZE];
  uint8_t  validCount = 0;

  // Procesar cada nuevo pulso
  bool revCompleted = false;
  for (uint8_t i = 0; i < newPulses; i++) {
    uint8_t  idx = (prevProcessedHead + i) % HALL_BUFFER_SIZE;
    uint32_t p   = periods[idx];
    if (p > HALL_DEBOUNCE_US && p < HALL_TIMEOUT_US) {
      filterBuffer[filterIndex] = p;
      filterIndex = (filterIndex + 1) % FILTER_SIZE;
      if (filterCount < FILTER_SIZE) filterCount++;

      rawPeriods[validCount++] = p;

      // Ventana deslizante de 1 vuelta para la velocidad de display
      revPeriodSum -= revPeriodBuffer[revBufIndex];
      revPeriodBuffer[revBufIndex] = p;
      revPeriodSum += p;
      revBufIndex = (revBufIndex + 1) % MAGNETS_COUNT;
      if (revBufCount < MAGNETS_COUNT) revBufCount++;

      // Log WebSocket (imán por imán)
      float rawRpmSample = HALL_CONST_RPM   / (float)p;
      float rawVelSample = HALL_CONST_SPEED / (float)p;
      logPulsoCrudo(p, rawRpmSample, rawVelSample);

      // Monitor de imanes
      magnetCount++;
      if (hallDebugActive) {
        Serial.printf("[HALL] %u/%u  p=%luus  v=%.3fm/s\n",
                      magnetCount, (uint8_t)MAGNETS_COUNT,
                      (unsigned long)p, HALL_CONST_SPEED / (float)p);
      }
      if (magnetCount >= MAGNETS_COUNT) {
        magnetCount  = 0;
        revCompleted = true;
      }
    }
  }

  if (filterCount == 0) return;

  // Calcular velocidad filtrada (mediana + EMA)
  float periodoMediano = getMedian(filterBuffer, FILTER_SIZE, filterCount);

  // Actualizar umbral del debounce dinámico (leído por la ISR)
  uint32_t nuevoUmbral = (uint32_t)(HALL_DEBOUNCE_RATIO * periodoMediano);
  if (nuevoUmbral < HALL_DEBOUNCE_US)     nuevoUmbral = HALL_DEBOUNCE_US;
  if (nuevoUmbral > HALL_DEBOUNCE_MAX_US) nuevoUmbral = HALL_DEBOUNCE_MAX_US;
  hallMinPeriodUs = nuevoUmbral;

  float rawRPM = HALL_CONST_RPM   / periodoMediano;
  float rawVel = HALL_CONST_SPEED / periodoMediano;

  filteredRPM_Last = (SMOOTH_ALPHA * rawRPM) + ((1.0f - SMOOTH_ALPHA) * filteredRPM_Last);
  filteredVel_Last = (SMOOTH_ALPHA * rawVel) + ((1.0f - SMOOTH_ALPHA) * filteredVel_Last);

  currentRPM           = filteredRPM_Last;
  currentLinearSpeedMs = filteredVel_Last;

  // Velocidad de display: promedio sobre la ventana de 1 vuelta.
  // vel = K / (sum/count) = K * count / sum
  if (revPeriodSum > 0) {
    displaySpeedMs = HALL_CONST_SPEED * (float)revBufCount / (float)revPeriodSum;
  }

