rafaelcapurroc-droid/esp32-motor-control/src/main.cpp
  if (hallDebugActive && revCompleted) {
    Serial.printf("[HALL] -- vuelta completa | Vel:%.3f m/s | RPM:%.1f\n",
                  currentLinearSpeedMs, currentRPM);
  }

  // --- CSV SERIAL: una línea por imán, con vel filtrada actualizada como referencia ---
  if (csvLogActive && validCount > 0 && setpointSpeed > 0.001f) {
    unsigned long t = millis();
    for (uint8_t i = 0; i < validCount; i++) {
      float velCruda = HALL_CONST_SPEED / (float)rawPeriods[i];
      float errRel   = (velCruda - setpointSpeed) / setpointSpeed;
      Serial.printf("%lu,%lu,%.4f,%.4f,%.4f\n",
        t, (unsigned long)rawPeriods[i],
        velCruda, setpointSpeed, errRel);
    }
  }

  // --- EJECUTAR PID MANUAL (event-driven) CADA VEZ QUE HAY UN PULSO ---
  computePID();
}

// ============================================================
// 17. LECTURA DE CORRIENTE
// ============================================================
static void updateCurrentReading() {
  if (millis() - lastCurrentReadTime < CURRENT_READ_INTERVAL) return;
  lastCurrentReadTime = millis();

  uint32_t sum = 0;
  for (int i = 0; i < 20; i++) sum += analogRead(MOTOR_CS_PIN);

  float voltage   = (sum / 20.0f) * (3.3f / 4095.0f);
  float corrected = max(voltage - CS_OFFSET_VOLTAGE, 0.0f);
  cachedCurrent   = corrected / CS_VOLTAGE_PER_AMP;
}

// ============================================================
// 18. COMANDOS SERIAL
// ============================================================
void procesarComandoSerial(const char* cmd) {
  char buf[64];
  strncpy(buf, cmd, sizeof(buf) - 1);
  buf[sizeof(buf) - 1] = '\0';
  for (char* p = buf; *p; p++) *p = toupper((unsigned char)*p);

  float v1;
  int pwmVal;

  if (strncmp(buf, "SET SP ", 7) == 0 && sscanf(buf + 7, "%f", &v1) == 1) {
    float sp = constrain(v1, 0.0f, 2.0f);
    setpointSpeed   = sp;
    pendingSetpoint = sp;
    setpointPending = false;

    if (sp == 0.0f) {
      motorStop();
      Serial.println("[SP] Motor detenido");
    } else {
      configurarMotorReversa();
      activarPID(sp);
      Serial.printf("[SP] Consigna: %.3f m/s\n", sp);
    }

  } else if (strcmp(buf, "GET VEL") == 0) {
    float error = setpointSpeed - currentLinearSpeedMs;
    Serial.printf("[VEL] %.3f m/s | SP: %.3f | PWM: %.0f | FF: %.0f | Int: %.3f | Err: %.3f | Ki*Int: %.1f\n",
      currentLinearSpeedMs, setpointSpeed, pidOutput, lastFF_PWM, 
      pidIntegral, error, Ki * pidIntegral);

  } else if (strcmp(buf, "GET ENC") == 0) {
    Serial.printf("[ENC] Raw: %d | Display: %d\n",
      encoder.getCount(), displayEncoderCount);

  } else if (strcmp(buf, "RESET ENC") == 0) {
    encoder.clearCount();
    lastStableCount     = 0;
    displayEncoderCount = 0;
    Serial.println("[ENC] Contadores reseteados");

  } else if (strcmp(buf, "GET CUR") == 0) {
    Serial.printf("[CUR] %.2f A\n", cachedCurrent);

  } else if (strcmp(buf, "STOP") == 0) {
    motorStop();
    Serial.println("[STOP] Motor detenido");

  } else if ( (strncmp(buf, "PWM ", 4) == 0 && sscanf(buf + 4, "%d", &pwmVal) == 1)
           || (strncmp(buf, "SET PWM ", 8) == 0 && sscanf(buf + 8, "%d", &pwmVal) == 1) ) {
    int pwm = (int)constrain(pwmVal, 0, MAX_VELOCITY);
    // Limpiar setpoint para que computePID() no sobreescriba el PWM manual
    setpointSpeed   = 0.0f;
    pendingSetpoint = 0.0f;
    setpointPending = false;
    myPID.SetMode(MANUAL);
    pidOut      = (double)pwm;
    pidIntegral = 0.0f;
    pidOutput   = (float)pwm;
    if (pwm > 0) configurarMotorReversa();
    else         motorParadaLibre();
    applyPWM(pwm);
    Serial.printf("[PWM] Manual PWM aplicado: %d\n", pwm);

  } else if (strncmp(buf, "TUNE ", 5) == 0) {
    float p, i, d;
    if (sscanf(buf + 5, "%f %f %f", &p, &i, &d) == 3) {
      Kp = p; Ki = i; Kd = d;
      myPID.SetTunings(Kp, Ki, Kd);
      Serial.printf("[TUNE] Kp=%.2f Ki=%.2f Kd=%.2f\n", Kp, Ki, Kd);
    }

  } else if (strcmp(buf, "HALL ON") == 0) {
    hallDebugActive = true;
    magnetCount     = 0;
    Serial.println("[HALL] Monitor activado — imprime cada iman y cada vuelta");

  } else if (strcmp(buf, "HALL OFF") == 0) {
    hallDebugActive = false;
    Serial.println("[HALL] Monitor desactivado");

  } else if (strcmp(buf, "LOG START") == 0) {
    csvLogActive = true;
    Serial.println("t_ms,periodo_us,vel_cruda_m_s,setpoint_m_s,error_rel");

  } else if (strcmp(buf, "LOG STOP") == 0) {
    csvLogActive = false;
    Serial.println("[LOG] Detenido");

  } else if (strcmp(buf, "HELP") == 0) {
    Serial.println("CMD: SET SP <m/s> | GET VEL | GET ENC | RESET ENC | GET CUR | STOP | TUNE <Kp Ki Kd> | PWM <0..MAX> | LOG START | LOG STOP | HALL ON | HALL OFF");

  } else {
    Serial.printf("[ERR] Desconocido: '%s'\n", cmd);
  }
}

static void leerSerial() {
  while (Serial.available()) {
    char c = Serial.read();
    if (c == '\n' || c == '\r') {
      if (serialIdx > 0) {
        serialBuf[serialIdx] = '\0';
        procesarComandoSerial(serialBuf);
        serialIdx = 0;
      }
    } else if (serialIdx < (sizeof(serialBuf) - 1)) {
      serialBuf[serialIdx++] = c;
    }
  }
}

// ============================================================
// 19. WEBSOCKET
// ============================================================
void broadcastState() {
  if (ws.count() == 0) {
    pulseLogCount    = 0;
    pulseLogOverflow = false;
    return;
  }

  JsonDocument doc;
  doc["velocity"]       = (int)round(pidOutput);
  doc["current"]        = cachedCurrent;
  doc["rpm"]            = currentRPM;
  doc["speed_m_s"]      = currentLinearSpeedMs;
  doc["speed_mm_s"]     = currentLinearSpeedMs * 1000.0f;
  doc["sp_m_s"]         = setpointSpeed;
  doc["sp_pending_m_s"] = setpointPending ? pendingSetpoint : setpointSpeed;
  doc["sp_pending"]     = setpointPending;
  doc["encoder"]        = displayEncoderCount;
  doc["encoder_raw"]    = encoder.getCount();
  doc["pid_integral"]   = pidIntegral;
  doc["ff_pwm"]         = lastFF_PWM;
  doc["kp"]             = Kp;
  doc["ki"]             = Ki;
  doc["kd"]             = Kd;

  // Log crudo imán por imán
  if (pulseLogCount > 0) {
    JsonArray pulses = doc["pulses"].to<JsonArray>();
    for (uint8_t i = 0; i < pulseLogCount; i++) {
      JsonObject p = pulses.add<JsonObject>();
      p["p"] = pulseLogBuffer[i].periodo_us;
      p["v"] = pulseLogBuffer[i].vel_m_s;
      p["r"] = pulseLogBuffer[i].rpm;
    }
    pulseLogCount = 0;
  }
  if (pulseLogOverflow) {
    doc["pulses_overflow"] = true;
    pulseLogOverflow = false;
  }

  String json;
  serializeJson(doc, json);
  ws.textAll(json);
}

