rafaelcapurroc-droid/esp32-motor-control/src/main.cpp
void onWebSocketEvent(AsyncWebSocket* srv, AsyncWebSocketClient* client,
                      AwsEventType type, void* arg, uint8_t* data, size_t len) {
  if (type == WS_EVT_CONNECT) {
    if (ws.count() > 2) { client->close(); return; }
    Serial.printf("[WS] Cliente conectado (id=%u, total=%u)\n",
                  client->id(), ws.count());
    isWebConnected = true;
    digitalWrite(LED_BUILTIN_PIN, HIGH);
    broadcastState();

  } else if (type == WS_EVT_DISCONNECT) {
    Serial.printf("[WS] Cliente desconectado (id=%u, total=%u)\n",
                  client->id(), ws.count());
    if (ws.count() == 0) {
      isWebConnected = false;
      digitalWrite(LED_BUILTIN_PIN, LOW);
    }

  } else if (type == WS_EVT_DATA) {
    AwsFrameInfo* info = (AwsFrameInfo*)arg;
    if (!info->final || info->index != 0 || info->len != len
        || info->opcode != WS_TEXT) return;

    JsonDocument doc;
    if (deserializeJson(doc, data, len)) return;

    bool changed = false;

    if (doc["led"].is<bool>()) {
      digitalWrite(LED_BUILTIN_PIN, doc["led"].as<bool>() ? HIGH : LOW);
      changed = true;
    }

    if (doc["sp"].is<float>() || doc["sp"].is<int>()) {
      float sp = constrain(doc["sp"].as<float>(), 0.0f, 2.0f);
      setpointSpeed   = sp;
      pendingSetpoint = sp;
      setpointPending = false;

      if (sp == 0.0f) {
        motorStop();
      } else {
        configurarMotorReversa();
        activarPID(sp);
      }
      changed = true;
    }

    if (doc["sp_pending"].is<float>() || doc["sp_pending"].is<int>()) {
      pendingSetpoint = constrain(doc["sp_pending"].as<float>(), 0.0f, 2.0f);
      setpointPending = true;
      changed = true;
    }

    if (doc["confirm_sp"].is<bool>() && doc["confirm_sp"].as<bool>()) {
      confirmarSetpoint();
      changed = true;
    }

    if (doc["stop"].is<bool>() && doc["stop"].as<bool>()) {
      motorStop();
      changed = true;
    }

    if (doc["tune"].is<JsonObject>()) {
      JsonObject t = doc["tune"].as<JsonObject>();
      Kp = t["kp"] | 50.0;
      Ki = t["ki"] | 5.0;
      Kd = t["kd"] | 0.0;
      myPID.SetTunings(Kp, Ki, Kd);
      Serial.printf("[TUNE WS] Kp=%.2f Ki=%.2f Kd=%.2f\n", Kp, Ki, Kd);
      changed = true;
    }

    if (changed) broadcastState();
  }
}

// ============================================================
// 20. PÁGINA DE DIAGNÓSTICO (FALLBACK)
// ============================================================
static const char FALLBACK_PAGE[] PROGMEM = R"HTML(
<!DOCTYPE html><html lang="es"><head>
<meta name="viewport" content="width=device-width,initial-scale=1">
<meta charset="UTF-8">
<title>Trotadora PID v9.11.0</title>
<style>
body{font-family:monospace;background:#0d0f14;color:#c8d0e0;padding:30px;max-width:620px;margin:0 auto}
h2{color:#00e5ff}
.metric{display:flex;justify-content:space-between;padding:6px 0;border-bottom:1px solid #1e2330}
button{padding:10px;background:#1e2330;border-radius:4px;cursor:pointer;margin:5px}
.row{display:flex;gap:8px;flex-wrap:wrap}
.pending{color:#ffaa00}
.confirmed{color:#39ff6e}
.ff{color:#ff8844}
.highlight{color:#00e5ff}
</style></head><body>
<h2>Trotadora PID v9.11.0</h2>
<div id="status">Conectando WebSocket...</div>
<div id="metrics"></div>
<div class="row">
  <button onclick="send({sp:0.5})">SP 0.5 m/s</button>
  <button onclick="send({sp:1.0})">SP 1.0 m/s</button>
  <button onclick="send({sp:1.5})">SP 1.5 m/s</button>
  <button onclick="send({stop:true})">STOP</button>
</div>
<div class="row">
  <input type="range" id="spSlider" min="0" max="200" step="1" value="0">
  <span id="sliderValue">0.00 m/s</span>
  <button onclick="send({sp_pending: parseFloat(document.getElementById('sliderValue').innerText)})">Set Pending</button>
  <button onclick="send({confirm_sp: true})">CONFIRMAR</button>
</div>
<script>
var ws;
function init(){
  ws=new WebSocket('ws://'+location.hostname+'/ws');
  ws.onopen=function(){document.getElementById('status').innerHTML='<span style="color:#39ff6e">Conectado</span>'};
  ws.onmessage=function(e){
    var d=JSON.parse(e.data);
    var pendingHtml = d.sp_pending ?
      '<span class="pending">PENDIENTE: '+d.sp_pending_m_s.toFixed(3)+' m/s</span>' :
      '<span class="confirmed">CONFIRMADO: '+d.sp_m_s.toFixed(3)+' m/s</span>';
    document.getElementById('metrics').innerHTML=`
      <div class="metric"><span>Velocidad actual</span><span>${(d.speed_m_s||0).toFixed(3)} m/s</span></div>
      <div class="metric"><span>Setpoint</span><span>${pendingHtml}</span></div>
      <div class="metric"><span>PWM</span><span>${d.velocity||0}</span></div>
      <div class="metric"><span>FF PWM</span><span class="ff">${(d.ff_pwm||0).toFixed(0)}</span></div>
      <div class="metric"><span>Ki × Integral</span><span class="highlight">${((d.ki||0) * (d.pid_integral||0)).toFixed(0)}</span></div>
      <div class="metric"><span>Encoder</span><span>${d.encoder||0}</span></div>
      <div class="metric"><span>Corriente</span><span>${(d.current||0).toFixed(2)} A</span></div>
      <div class="metric"><span>Kp=${(d.kp||0).toFixed(1)}</span><span>Ki=${(d.ki||0).toFixed(1)} Kd=${(d.kd||0).toFixed(1)}</span></div>
    `;
    document.getElementById('spSlider').value = d.sp_pending_m_s * 100;
    document.getElementById('sliderValue').innerText = d.sp_pending_m_s.toFixed(2);
  };
  ws.onclose=function(){document.getElementById('status').innerHTML='<span style="color:#ff3355">Desconectado</span>';setTimeout(init,2000)};
}
function send(obj){if(ws&&ws.readyState===1)ws.send(JSON.stringify(obj));}
var slider=document.getElementById('spSlider');
slider.oninput=function(){
  var val=this.value/100;
  document.getElementById('sliderValue').innerText=val.toFixed(2);
};
window.onload=init;
</script></body></html>
)HTML";

// ============================================================
// 21. HTTP
// ============================================================
void setupHTTPEndpoints() {
  if (LittleFS.begin(true)) {
    server.serveStatic("/", LittleFS, "/").setDefaultFile("index.html");
    Serial.println("[FS] LittleFS OK");
  } else {
    Serial.println("[FS] LittleFS no disponible — usando fallback");
  }
  server.onNotFound([](AsyncWebServerRequest* request) {
    request->send_P(200, "text/html", FALLBACK_PAGE);
  });
}

